[
  {
    "relationship": "supervisor",
    "firstName": "Michelle",
    "lastName": "Bury",
    "currentRole": "Director Central Academic Support",
    "currentCompany": "2u.com",
    "recommendationText": "During the past year as Director of Tutoring, I've had the pleasure of getting to know Corey as a tutor. With 200+ remote tutors on the team, it's a challenge to know or engage meaningfully with every tutor, but Corey always stood out in a positive way. Corey shared her positive energy not only with students, but with other tutors, as well as the team leads. She engaged regularly with other tutors seeking answers to their questions. She was diligent about keeping up with the constant updates our team has been challenged with this past year, asking for clarification when needed. Her communication with the tutor management team was always positive, professional, and timely. Corey put her students first even during very challenging personal times, and her students were loyal to her for it. Losing Corey from the tutoring team is a huge loss for our students and our entire team. I recommend Corey to any employer who is looking for someone who is dedicated, positive, patient, and effective."
  },
  {
    "relationship": "former student",
    "firstName": "Sarah",
    "lastName": "Goodell",
    "currentRole": "test",
    "currentCompany": "test",
    "recommendationText": "I am writing to wholeheartedly recommend Corey Yates for her exceptional support and guidance as a tutor during my time at the UCF Coding Bootcamp. Her dedication, expertise, and unwavering commitment to assisting students like myself significantly contributed to my success throughout the bootcamp.  Corey demonstrated an exceptional ability to communicate effectively, making complex coding concepts comprehensible and accessible. Her clear and concise explanations facilitated an efficient learning process. She was always approachable, fostering an environment where I felt comfortable seeking clarification and guidance.  Furthermore, Corey was incredibly accommodating, readily adjusting her schedule to meet the needs of her students. Despite her busy schedule, she made herself available to provide additional assistance whenever necessary. Her flexibility and willingness to adapt to my learning pace greatly enhanced my understanding of challenging topics.  Corey went above and beyond to ensure my understanding and progress in the program. She consistently sacrificed her own time to offer additional support whenever I encountered challenges or got stuck on complex coding concepts. Her willingness to provide extra assistance demonstrated her genuine investment in her students' success.  Moreover, Corey played a pivotal role in maintaining my motivation and positivity during moments of frustration or discouragement. Her encouragement, patience, and positive attitude were instrumental in helping me navigate the rigorous curriculum of the bootcamp. Her ability to keep me focused and motivated was invaluable.  Not only was Corey an excellent problem solver, but she also offered practical and insightful advice that significantly improved my coding skills. Her guidance was clear, concise, and tailored to address my specific areas of improvement. Her expertise and mentorship were crucial in enhancing my learning experience and overall performance.  As Corey transitions from tutoring to pursuing opportunities in the tech field, I have no doubt that her dedication, expertise, and genuine commitment to excellence will continue to shine. Her experience in guiding students through complex coding concepts coupled with her passion for technology will undoubtedly make her an exceptional addition to any tech-oriented team. Please feel free to contact me if you require any further information or clarification regarding Corey Yates or my experience at the bootcamp. I wholeheartedly recommend her without reservation and am confident in her ability to excel in any role within the tech industry.  Thank you for considering my recommendation."
  }
]